#include "aduc812.h"
#include "system.h"

/*----------------------------------------------------------------------------
                        RSioStat()
-------------------------------------------------------------------------------
Возвращает ненулевое значение, если буфер приема не пуст
Вход:       нет
Выход:      нет
Результат:  0 - буфер приема пуст;
            1 - был принят символ
----------------------------------------------------------------------------- */
//unsigned char rsiostat(void) { return RI; }

/*----------------------------------------------------------------------------
                        wsio
-------------------------------------------------------------------------------
Отправляет символ по последовательному каналу
Вход:       unsigned char c - символ, который нужно отправить
Выход:      нет
Результат:  нет
----------------------------------------------------------------------------- */
void wsio(unsigned char c) {
	SBUF = c;
	TI = 0;
	while (!TI)
		;
}
unsigned char rsiostat(void)  
{
  return RI;
}

/*
-------------------------------------------------------
                        rsio()
-------------------------------------------------------------------------------
Дожидается приема символа из последовательного канала и возвращает его.
Вход:       нет
Выход:      нет
Результат:  принятый символ
----------------------------------------------------------------------------- */
unsigned char rsio(void) {
	while (!RI) {
		if (GetDIP() != 1)
			break;
	}
	RI = 0;
	return SBUF;
}

/*----------------------------------------------------------------------------
                        SendString()
-------------------------------------------------------------------------------
Выводит ASCIIZ-строку в последовательный канал
Вход:       char *str - указатель на строку
Выход:      нет
Результат:  нет
----------------------------------------------------------------------------- */
void SendString(const char *str) {
	while (*str)
		wsio(*str++);
}